/*
* Заполнение замкнутой области
 
1. Создать текстовый файл (task10_field1.txt) в текстовом формате 50*50, где 0 - незаполненная точка, 1 - заполненная, 2 - граница.
2. Зачитать файл.
3. Заполнить замкнутую область двумя разными способами. Начальная точка задается ручным вводом.
4. Сделать замеры по времени для каждого способа, выводить его на экран.
5. Сохранить данные в текстовые файлы task10_field1_result_method1.txt, task10_field1_result_method2.txt соответственно.
6. Сохранить результат в бинарные файлы task10_field1_result_method1.bin, task10_field1_result_method2.bin соответственно.

- работа с текстовыми файлами
- работа с бинарными файлами
- профилирование
- рекурсия
 
*/

#include <iostream>
#include "task10.h"

void tasks::task10()
{
	std::cout << "Hello Task10!" << std::endl;
}